Import relevant libraries

In [1]:
import numpy as np
import pandas as pd

Load dataset

In [2]:
marketing_data = pd.read_csv("marketing_campaign.csv")

Subset for relevant columns

In [10]:
marketing_data = marketing_data[['Education', 'Marital_Status',
                'Kidhome', 'Teenhome']]

Inspect first 5 rows and data types of the dataset

In [11]:
marketing_data.head()

    Education Marital_Status  Kidhome  Teenhome
0  Graduation         Single        0         0
1  Graduation         Single        1         1
2  Graduation       Together        0         0
3  Graduation       Together        1         0
4         PhD        Married        1         0

In [12]:
marketing_data.dtypes

Education         object
Marital_Status    object
Kidhome            int64
Teenhome           int64
dtype: object

In [13]:
marketing_data.shape

(2240, 4)

Remove duplicates across the four columns

In [ ]:
marketing_data_duplicate = marketing_data.drop_duplicates()
# it will remove the data where all four columns are duplicated 
# if we want to remove duplication from a specific column we can us3 
# drop_duplicates(subset = ['Education', 'Maritial_Status'])

In [15]:
marketing_data_duplicate

       Education Marital_Status  Kidhome  Teenhome
0     Graduation         Single        0         0
1     Graduation         Single        1         1
2     Graduation       Together        0         0
3     Graduation       Together        1         0
4            PhD        Married        1         0
...          ...            ...      ...       ...
2134      Master         Absurd        0         0
2147      Master       Together        1         2
2177         PhD           YOLO        0         1
2208       Basic       Together        0         1
2223      Master        Married        1         2

[135 rows x 4 columns]

In [17]:
marketing_data_duplicate.shape

(135, 4)